# ==============================================================================
# פלט: חשיפת כתובת ה-ARN הייחודית של הסוד
# מאפשר למודולים אחרים (כמו ה-IAM או ה-RDS) לדעת בדיוק איפה הסוד ממוקם.
# ==============================================================================
output "secret_arn" {
  description = "The ARN of the secret"
  value       = aws_secretsmanager_secret.db_password.arn
}

# ==============================================================================
# פלט: חשיפת שם הסוד
# ==============================================================================
output "secret_name" {
  description = "The name of the secret"
  value       = aws_secretsmanager_secret.db_password.name
}