# ==============================================================================
# 1. יצירת ערוץ ההתראות (SNS Topic)
# הבלוק הזה פותח את ערוץ התקשורת ב-AWS ומעניק לו את השם שהגדרנו במשתנים.
# ==============================================================================
resource "aws_sns_topic" "alerts" {
  name = var.topic_name

  tags = {
    Name = var.topic_name
  }
}

# ==============================================================================
# 2. יצירת המנוי לערוץ (SNS Topic Subscription)
# הבלוק הזה מחבר כתובת אימייל לערוץ שיצרנו למעלה.
# ברגע שייווצר, AWS תשלח מייל אישור לכתובת הזו כדי לאמת אותה.
# ==============================================================================
resource "aws_sns_topic_subscription" "email_sub" {
  topic_arn = aws_sns_topic.alerts.arn
  protocol  = "email"
  endpoint  = var.alert_email
}