# ==============================================================================
# פלט: שם הדלי (מופיע כ-ID במשאבי S3)
# מאפשר למודולים אחרים או לסקריפטים לדעת בדיוק לאיזה שם לפנות כדי להעלות קבצים.
# ==============================================================================
output "bucket_name" {
  description = "The name of the bucket"
  value       = aws_s3_bucket.app_data.id
}

# ==============================================================================
# פלט: הכתובת הייחודית של הדלי במערכת (Bucket ARN)
# קריטי למודול ה-IAM
# שלנו, שצריך את הכתובת הזו כדי לתת הרשאות גישה ל
# Backend.
# ==============================================================================
output "bucket_arn" {
  description = "The ARN of the bucket"
  value       = aws_s3_bucket.app_data.arn
}